"""
Создать список произвольного содержания. Вывести на экран третий, пятый и шестой элементы
"""

listt = [1, 'two', 3, 'four', 5, 'six', 'seven', 8]

print(
    listt[2],
    listt[4],
    listt[5],
    sep='\n'
)
