"""
Создать множество произвольного содержания.
После каждой операции выводить множество на экран
"""

sett = {1, 'two', 3, 'four'}

print(sett)

sett.add(34)
print(sett)

sett.remove(34)
print(sett)
