"""
Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
"""

a = int(input('input first number: '))
b = int(input('input first number: '))

print(a + b)
print(a - b)
print(a * b)
