"""
Ввести с клавиатуры имя пользователя.
Вывести на экран “Hello, [name]!”
"""

firstname = input()
lastname = input()

print(
    f'Hello, {firstname} {lastname}'
)
