"""
Определить переменные всех 4
базовых типов и вывести их на экран
"""

a = 5
print(a)

b = 'string'
print(b)

c = 3.2
print(c)

d = True
print(d)
